faronov/cc2530-zigbee/tests/test_mac_frame.c
/* SPDX-License-Identifier: BSD-3-Clause
 * Copyright (c) 2026, cc2530-zigbee contributors. See LICENSE.
 */
#include "mac_frame.h"
#include "nwk_beacon.h"
#include "nwk_frame.h"
#include "cc2530_mmio.h"

#include <stddef.h>
#include <string.h>

#define CHECK(condition) do { if (!(condition)) return (uint16_t)__LINE__; } while (0)

static const MCU_CODE uint8_t golden[] = {
    0x61, 0x98, 0x5a, 0x34, 0x12, 0x78, 0x56, 0xbc, 0x9a, 0xaa, 0x55, 0xcc
};

static const MCU_CODE uint8_t command_payloads[][4] = {
    {0x01, 0x88, 0, 0}, {0x02, 0xbc, 0x9a, 0}, {0x02, 0xfe, 0xff, 0},
    {0x02, 0xff, 0xff, 1}, {0x02, 0xff, 0xff, 2},
    {0x03, 1, 0, 0}, {0x03, 2, 0, 0}, {0x04, 0, 0, 0}, {0x07, 0, 0, 0}
};
static const MCU_CODE uint8_t command_payload_lengths[] = {2, 4, 4, 4, 4, 2, 2, 1, 1};
static const MCU_CODE uint8_t command_frames[][25] = {
    {0x23, 0xc8, 0x5a, 0x34, 0x12, 0x78, 0x56, 0xff, 0xff,
     1, 2, 3, 4, 5, 6, 7, 8, 0x01, 0x88},
    {0x63, 0xcc, 0x5a, 0x34, 0x12, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28,
     1, 2, 3, 4, 5, 6, 7, 8, 0x02, 0xbc, 0x9a, 0},
    {0x63, 0xc8, 0x5a, 0x34, 0x12, 0x78, 0x56, 1, 2, 3, 4, 5, 6, 7, 8, 0x03, 2},
    {0x63, 0x88, 0x5a, 0x34, 0x12, 0x78, 0x56, 0xbc, 0x9a, 0x04},
    {0x23, 0x80, 0x5a, 0x34, 0x12, 0xbc, 0x9a, 0x04},
    {0x03, 0x08, 0x5a, 0xff, 0xff, 0xff, 0xff, 0x07},
    {0x23, 0xcc, 0x5a, 0x34, 0x12, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28,
     0xff, 0xff, 1, 2, 3, 4, 5, 6, 7, 8, 0x01, 0x88},
    {0x63, 0xcc, 0x5a, 0x34, 0x12, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28,
     1, 2, 3, 4, 5, 6, 7, 8, 0x03, 2},
    {0x63, 0xc8, 0x5a, 0x34, 0x12, 0x78, 0x56, 1, 2, 3, 4, 5, 6, 7, 8, 0x04},
    {0x63, 0x8c, 0x5a, 0x34, 0x12, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0xbc, 0x9a, 0x04},
    {0x63, 0xcc, 0x5a, 0x34, 0x12, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28,
     1, 2, 3, 4, 5, 6, 7, 8, 0x04},
    {0x23, 0xc0, 0x5a, 0x34, 0x12, 1, 2, 3, 4, 5, 6, 7, 8, 0x04}
};
static const MCU_CODE uint8_t command_frame_lengths[] = {19, 25, 17, 10, 8, 8, 25, 23, 16, 16, 22, 14};
static const MCU_CODE uint8_t command_frame_offsets[] = {17, 21, 15, 9, 7, 7, 23, 21, 15, 15, 21, 13};
static const MCU_CODE uint8_t command_destination_modes[] = {2, 3, 2, 2, 0, 2, 3, 3, 2, 3, 3, 0};
static const MCU_CODE uint8_t command_source_modes[] = {3, 3, 3, 2, 2, 0, 3, 3, 3, 2, 3, 3};

static const MCU_CODE uint8_t beacon_frames[][38] = {
    {0x00, 0x80, 0x5a, 0x34, 0x12, 0x78, 0x56, 0xff, 0xcf, 0x00, 0x00},
    {0x10, 0xc0, 0x5a, 0x34, 0x12, 1, 2, 3, 4, 5, 6, 7, 8,
     0x23, 0xdf, 0x80, 0x21, 0x78, 0x56,
     0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28,
     0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0xa9, 0x55, 0x69}
};

static void beacon_header(mac_header_t *header, uint8_t mode)
{
    memset(header, 0, sizeof(*header));
    header->type = MAC_FRAME_BEACON;
    header->source_mode = mode;
    header->source_pan = 0x1234;
    header->sequence = 0x5a;
    memset(header->source, 0x21, sizeof(header->source));
}

static uint16_t nwk_beacon_integration(void)
{
    static const MCU_CODE uint8_t nwk_payload[] = {
        0x00, 0x22, 0xac, 0x10, 0x32, 0x54, 0x76, 0x98, 0xba, 0xdc, 0xfe, 0xff, 0xff, 0xff, 0xa5
    };
    mac_header_t header;
    mac_frame_info_t frame;
    mac_beacon_info_t beacon;
    nwk_beacon_t network, saved;
    uint8_t payload[29], body[42], length;
    volatile uint8_t mode, offset;

    memset(payload, 0x69, sizeof(payload));
    payload[0] = 0xff;
    payload[1] = 0xcf;
    payload[2] = 0;
    payload[3] = 0x11;
    memcpy(payload + 14, nwk_payload, sizeof(nwk_payload));
    for (mode = MAC_ADDRESS_SHORT; mode <= MAC_ADDRESS_EXTENDED; mode++) {
        beacon_header(&header, mode);
        CHECK(mac_frame_encode(&header, payload, sizeof(payload), body, sizeof(body), &length) == MAC_CODEC_OK);
        CHECK(mac_frame_decode(body, length, &frame) == MAC_CODEC_OK);
        CHECK(frame.header.type == MAC_FRAME_BEACON);
        CHECK(mac_beacon_decode(body + frame.payload_offset, frame.payload_length, &beacon) == MAC_CODEC_OK);
        CHECK(beacon.short_count == 1 && beacon.extended_count == 1);
        CHECK(beacon.payload_offset == 14 && beacon.payload_length == NWK_BEACON_LENGTH);
        offset = (uint8_t)(frame.payload_offset + beacon.payload_offset);
        CHECK(offset == (mode == MAC_ADDRESS_SHORT ? 21u : 27u));
        CHECK(nwk_beacon_decode(body + offset, beacon.payload_length, &network) == NWK_BEACON_OK);
        CHECK(network.stack_profile == 2 && network.router_capacity == 1 && network.end_device_capacity == 1);
        CHECK(network.device_depth == 5 && network.update_id == 0xa5);
        CHECK(network.tx_offset == NWK_BEACON_BEACONLESS_OFFSET);
        CHECK(memcmp(network.extended_pan_id, nwk_payload + 3, 8) == 0);
        memset(&network, 0xa5, sizeof(network));
        memcpy(&saved, &network, sizeof(saved));
        CHECK(nwk_beacon_decode(body + frame.payload_offset, frame.payload_length, &network) == NWK_BEACON_TOO_LONG);
        CHECK(memcmp(&network, &saved, sizeof(network)) == 0);
        body[offset] = 0xff;
        CHECK(mac_frame_decode(body, length, &frame) == MAC_CODEC_OK);
        CHECK(mac_beacon_decode(body + frame.payload_offset, frame.payload_length, &beacon) == MAC_CODEC_OK);
        CHECK(nwk_beacon_decode(body + offset, beacon.payload_length, &network) == NWK_BEACON_UNSUPPORTED_PROTOCOL);
        CHECK(memcmp(&network, &saved, sizeof(network)) == 0);
    }
    return 0;
}

static uint16_t nwk_data_integration(void)
{
    static const MCU_CODE uint8_t application[108] = {0xa9, 0x55, 0x69};
    mac_header_t mac_header;
    mac_frame_info_t frame;
    nwk_header_t nwk_header;
    nwk_frame_info_t network, saved;
    uint8_t npdu[116], body[125], mac_length, nwk_length;
    volatile uint8_t destination, source, option, mac_size, nwk_size, i;

    memset(&mac_header, 0, sizeof(mac_header));
    mac_header.type = MAC_FRAME_DATA;
    mac_header.version = 1;
    mac_header.flags = MAC_FLAG_PAN_COMPRESSION | MAC_FLAG_ACK_REQUEST;
    mac_header.sequence = 0x5a;
    mac_header.destination_pan = mac_header.source_pan = 0x1234;
    memset(mac_header.destination, 0x45, 8);
    memset(mac_header.source, 0x67, 8);
    memset(&nwk_header, 0, sizeof(nwk_header));
    nwk_header.version = NWK_FRAME_PROTOCOL_VERSION;
    nwk_header.destination = 0x5678;
    nwk_header.source = 0x1234;
    nwk_header.radius = 0x1e;
    nwk_header.sequence = 0xa5;
    memset(nwk_header.destination_ieee, 0x21, 8);
    memset(nwk_header.source_ieee, 0x31, 8);
    for (destination = MAC_ADDRESS_SHORT; destination <= MAC_ADDRESS_EXTENDED; destination++) {
        for (source = MAC_ADDRESS_SHORT; source <= MAC_ADDRESS_EXTENDED; source++) {
            mac_header.destination_mode = destination;
            mac_header.source_mode = source;
            mac_size = (uint8_t)(9u + (destination == MAC_ADDRESS_EXTENDED ? 6u : 0u)
                                + (source == MAC_ADDRESS_EXTENDED ? 6u : 0u));
            for (option = 0; option < 4; option++) {
                nwk_header.flags = (uint16_t)((uint16_t)option << 11);
                nwk_size = (uint8_t)(8u + (option & 1u ? 8u : 0u) + (option & 2u ? 8u : 0u));
                CHECK(nwk_frame_encode(&nwk_header, application, (uint16_t)(116u - nwk_size),
                                       npdu, sizeof(npdu), &nwk_length) == NWK_CODEC_OK);
                CHECK(nwk_length == 116);
                if (mac_size > 9u) {
                    memset(body, 0xc7, sizeof(body));
                    mac_length = 0xa5;
                    CHECK(mac_frame_encode(&mac_header, npdu, nwk_length, body, sizeof(body),
                                           &mac_length) == MAC_CODEC_TOO_LONG);
                    CHECK(mac_length == 0xa5);
                    for (i = 0; i < sizeof(body); i++)
                        CHECK(body[i] == 0xc7);
                }
                CHECK(nwk_frame_encode(&nwk_header, application, (uint16_t)(125u - mac_size - nwk_size),
                                       npdu, sizeof(npdu), &nwk_length) == NWK_CODEC_OK);
                CHECK(mac_frame_encode(&mac_header, npdu, nwk_length, body, sizeof(body),
                                       &mac_length) == MAC_CODEC_OK);
                CHECK(mac_length == 125);
                CHECK(mac_frame_decode(body, mac_length, &frame) == MAC_CODEC_OK);
                CHECK(frame.header.type == MAC_FRAME_DATA);
                CHECK(frame.payload_offset == mac_size && frame.payload_length == nwk_length);
                CHECK(nwk_frame_decode(body + frame.payload_offset, frame.payload_length,
                                       &network) == NWK_CODEC_OK);
                CHECK(network.payload_offset == nwk_size && network.payload_length == 125u - mac_size - nwk_size);
                CHECK(network.header.destination == 0x5678 && network.header.source == 0x1234);
                CHECK(network.header.radius == 0x1e && network.header.sequence == 0xa5);
                CHECK(network.header.flags == nwk_header.flags);
                CHECK(memcmp(body + mac_size + network.payload_offset, application, network.payload_length) == 0);
                memcpy(&saved, &network, sizeof(saved));
                body[mac_size + 1u] |= 2;
                CHECK(mac_frame_decode(body, mac_length, &frame) == MAC_CODEC_OK);
                CHECK(nwk_frame_decode(body + frame.payload_offset, frame.payload_length,
                                       &network) == NWK_CODEC_UNSUPPORTED_SECURITY);
                CHECK(memcmp(&network, &saved, sizeof(network)) == 0);
                body[mac_size + 1u] &= (uint8_t)~2u;
                body[mac_size] |= 1;
                CHECK(mac_frame_decode(body, mac_length, &frame) == MAC_CODEC_OK);
                CHECK(nwk_frame_decode(body + frame.payload_offset, frame.payload_length,
                                       &network) == NWK_CODEC_UNSUPPORTED_TYPE);
                CHECK(memcmp(&network, &saved, sizeof(network)) == 0);
            }
        }
    }
    return 0;
}

static uint16_t beacon_vectors(void)
{
    mac_frame_info_t frame, saved;
    mac_beacon_info_t beacon;
    mac_codec_result_t status;
    uint8_t output[40], length, i;
    /* Keep harness loop state out of SDCC's scarce IRAM spill slots. */
    volatile uint8_t vector, size, offset, minimum, boundary;

