faronov/cc2530-zigbee/tests/test_mac_frame.c
    memset(&saved, 0xa5, sizeof(saved));
    for (vector = 0; vector < 2; vector++) {
        size = vector ? 38 : 11;
        offset = vector ? 13 : 7;
        minimum = vector ? 35 : 11;
        CHECK(mac_frame_decode(beacon_frames[vector], size, &frame) == MAC_CODEC_OK);
        CHECK(frame.header.type == MAC_FRAME_BEACON && frame.header.version == 0);
        CHECK(frame.header.source_mode == (vector ? MAC_ADDRESS_EXTENDED : MAC_ADDRESS_SHORT));
        CHECK(frame.header.source_pan == 0x1234 && frame.header.sequence == 0x5a);
        CHECK(frame.header.flags == (vector ? MAC_FLAG_PENDING : 0));
        CHECK(frame.header.destination_mode == MAC_ADDRESS_NONE && frame.header.destination_pan == 0);
        for (i = 0; i < 8; i++)
            CHECK(frame.header.destination[i] == 0);
        CHECK(frame.payload_offset == offset && frame.payload_length == size - offset);
        CHECK(mac_beacon_decode(beacon_frames[vector] + offset, size - offset, &beacon) == MAC_CODEC_OK);
        CHECK(beacon.superframe_specification == (vector ? 0xdf23u : 0xcfffu));
        CHECK(beacon.gts_permit == vector && beacon.short_count == vector);
        CHECK(beacon.extended_count == 2u * vector && beacon.short_offset == 4);
        CHECK(beacon.extended_offset == (vector ? 6u : 4u));
        CHECK(beacon.payload_offset == (vector ? 22u : 4u) && beacon.payload_length == 3u * vector);
        for (boundary = 0; boundary <= size + 1u; boundary++) {
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            status = mac_frame_encode(&frame.header, beacon_frames[vector] + offset, size - offset,
                                      output + 1, boundary, &length);
            if (boundary < size) {
                CHECK(status == MAC_CODEC_BUFFER_TOO_SMALL && length == 0xa5);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            } else {
                CHECK(status == MAC_CODEC_OK && length == size);
                CHECK(memcmp(output + 1, beacon_frames[vector], size) == 0);
                CHECK(output[0] == 0xc7 && output[size + 1u] == 0xc7);
            }
        }
        for (boundary = 0; boundary <= size; boundary++) {
            frame = saved;
            status = mac_frame_decode(beacon_frames[vector], boundary, &frame);
            if (boundary < minimum) {
                CHECK(status == MAC_CODEC_TRUNCATED);
                CHECK(memcmp(&frame, &saved, sizeof(frame)) == 0);
            } else {
                CHECK(status == MAC_CODEC_OK && frame.payload_length == boundary - offset);
                CHECK(mac_beacon_decode(beacon_frames[vector] + offset, boundary - offset, &beacon) == MAC_CODEC_OK);
                CHECK(beacon.payload_length == boundary - minimum);
            }
        }
    }
    return 0;
}

static uint16_t beacon_address_lists(void)
{
    mac_header_t header;
    mac_frame_info_t frame;
    mac_beacon_info_t beacon, saved;
    uint8_t payload[113], output[127], length;
    volatile uint8_t short_count, extended_count, offset, tail, mode, n;

    memset(&saved, 0xa5, sizeof(saved));
    memset(payload, 0x69, sizeof(payload));
    payload[0] = 0xff;
    payload[1] = 0xcf;
    for (short_count = 0; short_count <= 7; short_count++) {
        for (extended_count = 0; extended_count <= 7u - short_count; extended_count++) {
            payload[2] = (short_count & 1u) ? 0x80 : 0;
            payload[3] = (uint8_t)(short_count | (extended_count << 4));
            offset = (uint8_t)(4u + 2u * short_count + 8u * extended_count);
            for (n = 0; n < offset; n++) {
                beacon = saved;
                CHECK(mac_beacon_decode(payload, n, &beacon) == MAC_CODEC_TRUNCATED);
                CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
            }
            for (tail = 0; tail <= 52; tail += 52) {
                CHECK(mac_beacon_decode(payload, offset + tail, &beacon) == MAC_CODEC_OK);
                CHECK(beacon.short_count == short_count && beacon.extended_count == extended_count);
                CHECK(beacon.extended_offset == 4u + 2u * short_count);
                CHECK(beacon.payload_offset == offset && beacon.payload_length == tail);
                for (mode = MAC_ADDRESS_SHORT; mode <= MAC_ADDRESS_EXTENDED; mode++) {
                    beacon_header(&header, mode);
                    header.flags = MAC_FLAG_PENDING;
                    memset(output, 0xc7, sizeof(output));
                    CHECK(mac_frame_encode(&header, payload, offset + tail, output + 1, 125, &length) == MAC_CODEC_OK);
                    CHECK(length == offset + tail + (mode == MAC_ADDRESS_SHORT ? 7u : 13u));
                    CHECK(output[0] == 0xc7 && output[length + 1u] == 0xc7);
                    CHECK(mac_frame_decode(output + 1, length, &frame) == MAC_CODEC_OK);
                    CHECK(frame.payload_length == offset + tail && frame.header.flags == MAC_FLAG_PENDING);
                    CHECK(memcmp(output + 1 + frame.payload_offset, payload, offset + tail) == 0);
                }
            }
            beacon = saved;
            CHECK(mac_beacon_decode(payload, offset + 53u, &beacon) == MAC_CODEC_TOO_LONG);
            CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
        }
    }
    CHECK(mac_beacon_decode(NULL, 0, &beacon) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_beacon_decode(payload, 4, NULL) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_beacon_decode(payload, 65535u, &beacon) == MAC_CODEC_TOO_LONG);
    CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
    return 0;
}

static uint16_t beacon_rejections(void)
{
    mac_header_t header;
    mac_beacon_info_t beacon, saved;
    mac_frame_info_t frame, saved_frame;
    mac_codec_result_t expected;
    uint8_t input[13], output[13], length, test, i;

    memset(&saved, 0xa5, sizeof(saved));
    memset(&saved_frame, 0xa5, sizeof(saved_frame));
    for (test = 0; test < 10; test++) {
        memcpy(input, beacon_frames[0], 11);
        input[11] = input[12] = 0xff;
        expected = MAC_CODEC_INVALID_BEACON;
        switch (test) {
        case 0: input[8] |= 0x20; break;
        case 1: input[9] = 0x08; break;
        case 2: input[9] = 0x40; break;
        case 3: input[10] = 0x08; break;
        case 4: input[10] = 0x80; break;
        case 5: input[10] = 0x44; break;
        case 6: input[10] = 1; break;
        default:
            input[9] = (uint8_t)(test - 6u);
            expected = MAC_CODEC_UNSUPPORTED_BEACON;
            break;
        }
        beacon = saved;
        CHECK(mac_beacon_decode(input + 7, 6, &beacon) == expected);
        CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
        frame = saved_frame;
        CHECK(mac_frame_decode(input, sizeof(input), &frame) == expected);
        CHECK(memcmp(&frame, &saved_frame, sizeof(frame)) == 0);
        beacon_header(&header, MAC_ADDRESS_SHORT);
        memset(output, 0xc7, sizeof(output));
        length = 0xa5;
        CHECK(mac_frame_encode(&header, input + 7, 6, output, sizeof(output), &length) == expected);
        CHECK(length == 0xa5);
        for (i = 0; i < sizeof(output); i++)
            CHECK(output[i] == 0xc7);
    }
    for (test = 0; test < 9; test++) {
        beacon_header(&header, MAC_ADDRESS_SHORT);
        expected = MAC_CODEC_INVALID_HEADER;
        switch (test) {
        case 0:
            header.flags = MAC_FLAG_SECURITY;
            expected = MAC_CODEC_UNSUPPORTED_SECURITY;
            break;
        case 1:
            header.version = 1;
            expected = MAC_CODEC_UNSUPPORTED_VERSION;
            break;
        case 2: header.flags = MAC_FLAG_ACK_REQUEST; break;
        case 3: header.flags = MAC_FLAG_PAN_COMPRESSION; break;
        case 4:
            header.source_mode = 1;
            expected = MAC_CODEC_UNSUPPORTED_ADDRESSING;
            break;
        case 5:
            header.destination_mode = MAC_ADDRESS_SHORT;
            expected = MAC_CODEC_UNSUPPORTED_ADDRESSING;
            break;
        case 6: header.source[0] = 0xfe; header.source[1] = 0xff; break;
        case 7: header.source[0] = header.source[1] = 0xff; break;
        default: header.source_pan = 0xffff; break;
        }
        memcpy(input, beacon_frames[0], 11);
        input[0] = header.flags;
        input[1] = (uint8_t)((header.source_mode << 6) | (header.version << 4) | (header.destination_mode << 2));
        input[3] = (uint8_t)header.source_pan;
        input[4] = (uint8_t)(header.source_pan >> 8);
        memcpy(input + 5, header.source, 2);
        frame = saved_frame;
        CHECK(mac_frame_decode(input, 11, &frame) == expected);
        CHECK(memcmp(&frame, &saved_frame, sizeof(frame)) == 0);
        memset(output, 0xc7, sizeof(output));
        length = 0xa5;
        CHECK(mac_frame_encode(&header, input + 7, 4, output, sizeof(output), &length) == expected);
        CHECK(length == 0xa5);
        for (i = 0; i < sizeof(output); i++)
            CHECK(output[i] == 0xc7);
    }
    return 0;
}

static void data_header(mac_header_t *header)
{
    memset(header, 0, sizeof(*header));
    header->type = MAC_FRAME_DATA;
    header->version = 1;
    header->flags = MAC_FLAG_ACK_REQUEST | MAC_FLAG_PAN_COMPRESSION;
    header->sequence = 0x5a;
    header->destination_mode = MAC_ADDRESS_SHORT;
    header->source_mode = MAC_ADDRESS_SHORT;
    header->destination_pan = 0x1234;
    header->source_pan = 0x1234;
    header->destination[0] = 0x78;
    header->destination[1] = 0x56;
    header->source[0] = 0xbc;
    header->source[1] = 0x9a;
}

/* Keep shared-image harness temporaries out of SDCC's IRAM spill slots. */
static void command_header(mac_header_t *volatile header, uint8_t vector)
{
    uint8_t i;
    data_header(header);
    header->type = MAC_FRAME_COMMAND;
    header->version = 0;
    header->destination_mode = command_destination_modes[vector];
    header->source_mode = command_source_modes[vector];
    if (header->source_mode == MAC_ADDRESS_EXTENDED) {
        for (i = 0; i < 8; i++)
            header->source[i] = (uint8_t)(i + 1u);
    }
    if (header->destination_mode == MAC_ADDRESS_EXTENDED) {
        for (i = 0; i < 8; i++)
            header->destination[i] = (uint8_t)(0x21u + i);
    }
    if (vector == 0u || vector == 6u) {
        header->flags = MAC_FLAG_ACK_REQUEST;
        header->source_pan = 0xffff;
    } else if (header->destination_mode == MAC_ADDRESS_NONE) {
        header->flags = MAC_FLAG_ACK_REQUEST;
    } else if (vector == 5u) {
        header->source_mode = MAC_ADDRESS_NONE;
        header->destination_pan = 0xffff;
        header->destination[0] = header->destination[1] = 0xff;
        header->flags = 0;
    }
}

static uint16_t command_vectors(void)
{
    mac_command_t decoded, saved;
    mac_codec_result_t status;
    uint8_t output[6], length, i;
    volatile uint8_t size, vector, boundary;
    volatile uint16_t expected_address;

