faronov/cc2530-zigbee/tests/test_mac_frame.c
    memset(&saved, 0xa5, sizeof(saved));
    for (vector = 0; vector < sizeof(command_payload_lengths); vector++) {
        size = command_payload_lengths[vector];
        CHECK(mac_command_decode(command_payloads[vector], size, &decoded) == MAC_CODEC_OK);
        CHECK(decoded.identifier == command_payloads[vector][0]);
        CHECK(decoded.capability == (vector == 0u ? 0x88u : 0u));
        CHECK(decoded.reason == (vector == 5u ? 1u : (vector == 6u ? 2u : 0u)));
        CHECK(decoded.status == (vector == 3u ? 1u : (vector == 4u ? 2u : 0u)));
        expected_address = vector == 1u ? 0x9abcu : (vector == 2u ? 0xfffeu
                           : ((vector == 3u || vector == 4u) ? 0xffffu : 0u));
        CHECK(decoded.short_address == expected_address);
        for (boundary = 0; boundary <= size + 1u; boundary++) {
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            status = mac_command_encode(&decoded, output + 1, boundary, &length);
            if (boundary < size) {
                CHECK(status == MAC_CODEC_BUFFER_TOO_SMALL && length == 0xa5);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            } else {
                CHECK(status == MAC_CODEC_OK && length == size);
                CHECK(memcmp(output + 1, command_payloads[vector], size) == 0);
                CHECK(output[0] == 0xc7 && output[size + 1u] == 0xc7);
            }
        }
        for (boundary = 0; boundary < size; boundary++) {
            decoded = saved;
            CHECK(mac_command_decode(command_payloads[vector], boundary, &decoded) == MAC_CODEC_TRUNCATED);
            CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
        }
        memcpy(output, command_payloads[vector], size);
        output[size] = 0;
        CHECK(mac_command_decode(output, size + 1u, &decoded)
              == (size == 4u ? MAC_CODEC_TOO_LONG : MAC_CODEC_INVALID_COMMAND));
        CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    }
    decoded = saved;
    decoded.identifier = MAC_COMMAND_DATA_REQUEST;
    CHECK(mac_command_encode(&decoded, output, sizeof(output), &length) == MAC_CODEC_OK);
    CHECK(length == 1 && output[0] == 4);
    CHECK(mac_command_decode(NULL, 0, &decoded) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_command_decode(output, 1, NULL) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_command_decode(output, 65535u, &decoded) == MAC_CODEC_TOO_LONG);
    CHECK(mac_command_encode(NULL, output, sizeof(output), &length) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_command_encode(&decoded, NULL, 4, &length) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_command_encode(&decoded, output, 4, NULL) == MAC_CODEC_INVALID_ARGUMENT);
    return 0;
}

static uint16_t command_frame_vectors(void)
{
    mac_header_t header;
    mac_frame_info_t decoded, saved;
    mac_codec_result_t status;
    uint8_t output[27], length, i;
    volatile uint8_t size, offset, vector, boundary;

    memset(&saved, 0xa5, sizeof(saved));
    for (vector = 0; vector < sizeof(command_frame_lengths); vector++) {
        size = command_frame_lengths[vector];
        offset = command_frame_offsets[vector];
        command_header(&header, vector);
        for (boundary = 0; boundary <= size; boundary++) {
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            status = mac_frame_encode(&header, command_frames[vector] + offset, size - offset,
                                      output + 1, boundary, &length);
            if (boundary < size) {
                CHECK(status == MAC_CODEC_BUFFER_TOO_SMALL && length == 0xa5);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            } else {
                CHECK(status == MAC_CODEC_OK && length == size);
                CHECK(memcmp(output + 1, command_frames[vector], size) == 0);
                CHECK(output[0] == 0xc7 && output[size + 1u] == 0xc7);
            }
        }
        for (boundary = 0; boundary <= size; boundary++) {
            decoded = saved;
            status = mac_frame_decode(command_frames[vector], boundary, &decoded);
            if (boundary < size) {
                CHECK(status == MAC_CODEC_TRUNCATED);
                CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
            } else {
                CHECK(status == MAC_CODEC_OK && decoded.header.type == MAC_FRAME_COMMAND);
                CHECK(decoded.header.version == 0 && decoded.header.sequence == 0x5a);
                CHECK(decoded.payload_offset == offset && decoded.payload_length == size - offset);
                CHECK(decoded.header.destination_pan == (header.destination_mode == 0u ? 0u : header.destination_pan));
                CHECK(decoded.header.source_pan == (vector == 5u ? 0u : header.source_pan));
                if (header.destination_mode == 0u || header.source_mode == 0u)
                    for (i = 0; i < 8; i++)
                        CHECK((header.destination_mode == 0u ? decoded.header.destination[i] : decoded.header.source[i]) == 0);
            }
        }
        memcpy(output, command_frames[vector], size);
        output[0] |= MAC_FLAG_PENDING;
        CHECK(mac_frame_decode(output, size, &decoded) == MAC_CODEC_OK);
        CHECK(decoded.header.flags == (header.flags | MAC_FLAG_PENDING));
        memset(output, 0xc7, sizeof(output));
        length = 0xa5;
        CHECK(mac_frame_encode(&decoded.header, command_frames[vector] + offset, size - offset,
                               output, sizeof(output), &length) == MAC_CODEC_INVALID_HEADER);
        CHECK(length == 0xa5);
        for (i = 0; i < sizeof(output); i++)
            CHECK(output[i] == 0xc7);
    }
    return 0;
}

#if !defined(__SDCC)
static uint16_t command_address_shapes(void)
{
    mac_header_t header;
    mac_frame_info_t decoded;
    mac_codec_result_t status;
    uint8_t output[27], length, vector, destination, source, flags, expected, accepted = 0, i;

    for (vector = 0; vector < 6; vector++) {
        if (vector == 4u)
            continue;
        for (destination = 0; destination < 4; destination++) {
            for (source = 0; source < 4; source++) {
                for (flags = 0; flags < 8; flags++) {
                    command_header(&header, vector);
                    header.destination_mode = destination;
                    header.source_mode = source;
                    header.flags = (uint8_t)(flags << 4);
                    if (vector == 0u)
                        expected = destination >= 2u && source == 3u && flags == 2u;
                    else if (vector == 1u)
                        expected = destination == 3u && source == 3u && flags == 6u;
                    else if (vector == 2u)
                        expected = destination >= 2u && source == 3u && flags == 6u;
                    else if (vector == 3u)
                        expected = destination != 1u && source >= 2u && flags == (destination ? 6u : 2u);
                    else
                        expected = destination == 2u && source == 0u && flags == 0u;
                    memset(output, 0xc7, sizeof(output));
                    length = 0xa5;
                    status = mac_frame_encode(&header, command_frames[vector] + command_frame_offsets[vector],
                                              command_frame_lengths[vector] - command_frame_offsets[vector],
                                              output + 1, 25, &length);
                    CHECK((status == MAC_CODEC_OK) == expected);
                    if (expected) {
                        accepted++;
                        CHECK(mac_frame_decode(output + 1, length, &decoded) == MAC_CODEC_OK);
                        CHECK(decoded.header.destination_mode == destination && decoded.header.source_mode == source);
                        CHECK(decoded.header.flags == header.flags);
                        CHECK(decoded.payload_length == command_frame_lengths[vector] - command_frame_offsets[vector]);
                        CHECK(output[0] == 0xc7 && output[length + 1u] == 0xc7);
                    } else {
                        CHECK(length == 0xa5);
                        for (i = 0; i < sizeof(output); i++)
                            CHECK(output[i] == 0xc7);
                    }
                }
            }
        }
    }
    CHECK(accepted == 12u);
    return 0;
}
#endif

static uint16_t command_payload_rejections(void)
{
    static const MCU_CODE uint8_t invalid[][4] = {
        {1, 0x10, 0, 0}, {1, 0x20, 0, 0}, {2, 0xff, 0xff, 0},
        {2, 0xfe, 0xff, 1}, {2, 0, 0, 2}, {2, 0xff, 0xff, 3},
        {3, 0, 0, 0}, {3, 3, 0, 0}, {5, 0, 0, 0}, {6, 0, 0, 0},
        {8, 0, 0, 0}, {9, 0, 0, 0}
    };
    mac_command_t command, saved;
    uint8_t test, size;
    mac_codec_result_t expected;

