faronov/cc2530-zigbee/tests/test_mac_frame.c
    memset(&saved, 0xa5, sizeof(saved));
    for (test = 0; test < sizeof(invalid) / sizeof(invalid[0]); test++) {
        size = invalid[test][0] == 2u ? 4u : 2u;
        command = saved;
        expected = test >= 8u ? MAC_CODEC_UNSUPPORTED_COMMAND : MAC_CODEC_INVALID_COMMAND;
        CHECK(mac_command_decode(invalid[test], size, &command) == expected);
        CHECK(memcmp(&command, &saved, sizeof(saved)) == 0);
    }
    return 0;
}

#if !defined(__SDCC)
static uint16_t command_frame_rejections(void)
{
    mac_frame_info_t decoded, frame_saved;
    mac_header_t header;
    uint8_t body[27], output[27], length, test, vector, size, i;
    mac_codec_result_t expected;

    memset(&frame_saved, 0xa5, sizeof(frame_saved));
    for (vector = 0; vector < 6; vector++) {
        size = command_frame_lengths[vector];
        for (test = 0; test < 8; test++) {
            command_header(&header, vector);
            memcpy(body, command_frames[vector], size);
            switch (test) {
            case 0:
                body[command_frame_offsets[vector]] = 0xff;
                expected = MAC_CODEC_UNSUPPORTED_COMMAND;
                break;
            case 1:
                body[size] = 0;
                expected = size - command_frame_offsets[vector] == 4u
                           ? MAC_CODEC_TOO_LONG : MAC_CODEC_INVALID_COMMAND;
                break;
            case 2:
                body[1] |= 0x10;
                header.version = 1;
                expected = MAC_CODEC_UNSUPPORTED_VERSION;
                break;
            case 3:
                body[0] ^= MAC_FLAG_ACK_REQUEST;
                header.flags ^= MAC_FLAG_ACK_REQUEST;
                expected = MAC_CODEC_INVALID_HEADER;
                break;
            case 4:
                if (vector == 0u) {
                    body[7] = 0xfe;
                    header.source_pan = 0xfffe;
                } else if (vector == 4u) {
                    body[5] = 0xfe;
                    body[6] = 0xff;
                    header.source[0] = 0xfe;
                    header.source[1] = 0xff;
                } else if (vector == 5u) {
                    body[3] = 0xfe;
                    header.destination_pan = 0xfffe;
                } else
                    continue;
                expected = MAC_CODEC_INVALID_HEADER;
                break;
            case 5:
                body[0] |= MAC_FLAG_SECURITY;
                header.flags |= MAC_FLAG_SECURITY;
                expected = MAC_CODEC_UNSUPPORTED_SECURITY;
                break;
            case 6:
                if (vector == 1u || vector == 4u)
                    continue;
                body[5] = vector == 5u ? 0xfdu : 0xfeu;
                body[6] = 0xff;
                header.destination[0] = body[5];
                header.destination[1] = body[6];
                expected = MAC_CODEC_INVALID_HEADER;
                break;
            default:
                if (vector == 0u)
                    body[command_frame_offsets[vector] + 1u] |= 0x10;
                else if (vector == 1u)
                    body[command_frame_offsets[vector] + 1u] = body[command_frame_offsets[vector] + 2u] = 0xff;
                else if (vector == 2u)
                    body[command_frame_offsets[vector] + 1u] = 0;
                else
                    continue;
                expected = MAC_CODEC_INVALID_COMMAND;
                break;
            }
            decoded = frame_saved;
            CHECK(mac_frame_decode(body, size + (test == 1u), &decoded) == expected);
            CHECK(memcmp(&decoded, &frame_saved, sizeof(frame_saved)) == 0);
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            CHECK(mac_frame_encode(&header, body + command_frame_offsets[vector],
                                   size - command_frame_offsets[vector] + (test == 1u),
                                   output, sizeof(output), &length) == expected);
            CHECK(length == 0xa5);
            for (i = 0; i < sizeof(output); i++)
                CHECK(output[i] == 0xc7);
        }
        command_header(&header, vector);
        if (header.flags & MAC_FLAG_PAN_COMPRESSION) {
            header.source_pan++;
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            CHECK(mac_frame_encode(&header, command_frames[vector] + command_frame_offsets[vector],
                                   size - command_frame_offsets[vector], output, sizeof(output), &length)
                  == MAC_CODEC_INVALID_HEADER);
            CHECK(length == 0xa5);
            for (i = 0; i < sizeof(output); i++)
                CHECK(output[i] == 0xc7);
        }
    }
    command_header(&header, 3);
    CHECK(mac_frame_encode(&header, NULL, 0, output, sizeof(output), &length) == MAC_CODEC_TRUNCATED);
    return 0;
}
#endif

static uint16_t golden_vectors(void)
{
    mac_header_t header;
    mac_frame_info_t decoded;
    uint8_t output[25], length, i;
    static const MCU_CODE uint8_t long_destination[] = {
        0x01, 0x8c, 0x07, 0x34, 0x12, 1, 2, 3, 4, 5, 6, 7, 8,
        0xcd, 0xab, 0x34, 0x12, 0xef
    };
    static const MCU_CODE uint8_t ack[] = {0x12, 0x00, 0xff};

    data_header(&header);
    CHECK(mac_frame_encode(&header, golden + 9, 3, output, sizeof(output), &length) == MAC_CODEC_OK);
    CHECK(length == sizeof(golden) && memcmp(output, golden, sizeof(golden)) == 0);
    CHECK(header.flags == (MAC_FLAG_ACK_REQUEST | MAC_FLAG_PAN_COMPRESSION));
    CHECK(mac_frame_decode(golden, sizeof(golden), &decoded) == MAC_CODEC_OK);
    CHECK(decoded.header.type == MAC_FRAME_DATA && decoded.header.version == 1);
    CHECK(decoded.header.sequence == 0x5a && decoded.header.flags == 0x60);
    CHECK(decoded.header.destination_pan == 0x1234 && decoded.header.source_pan == 0x1234);
    CHECK(decoded.payload_offset == 9 && decoded.payload_length == 3);
    CHECK(decoded.header.destination[0] == 0x78 && decoded.header.destination[1] == 0x56);
    CHECK(decoded.header.source[0] == 0xbc && decoded.header.source[1] == 0x9a);
    for (i = 2; i < 8; i++)
        CHECK(decoded.header.destination[i] == 0 && decoded.header.source[i] == 0);

    CHECK(mac_frame_decode(long_destination, sizeof(long_destination), &decoded) == MAC_CODEC_OK);
    CHECK(decoded.header.version == 0 && decoded.header.flags == 0);
    CHECK(decoded.header.destination_mode == MAC_ADDRESS_EXTENDED && decoded.header.source_mode == MAC_ADDRESS_SHORT);
    CHECK(decoded.header.destination_pan == 0x1234 && decoded.header.source_pan == 0xabcd);
    CHECK(decoded.payload_offset == 17 && decoded.payload_length == 1);
    for (i = 0; i < 8; i++)
        CHECK(decoded.header.destination[i] == i + 1u);
    CHECK(mac_frame_encode(&decoded.header, long_destination + 17, 1,
                           output, sizeof(output), &length) == MAC_CODEC_OK);
    CHECK(length == sizeof(long_destination) && memcmp(output, long_destination, length) == 0);

    CHECK(mac_frame_decode(ack, sizeof(ack), &decoded) == MAC_CODEC_OK);
    CHECK(decoded.header.type == MAC_FRAME_ACK && decoded.header.flags == MAC_FLAG_PENDING);
    CHECK(decoded.header.version == 0 && decoded.header.sequence == 255);
    CHECK(decoded.header.destination_mode == 0 && decoded.header.source_mode == 0);
    CHECK(decoded.header.destination_pan == 0 && decoded.header.source_pan == 0);
    CHECK(decoded.payload_offset == 3 && decoded.payload_length == 0);
    CHECK(mac_frame_encode(&decoded.header, NULL, 0, output, 3, &length) == MAC_CODEC_OK);
    CHECK(length == 3 && memcmp(output, ack, 3) == 0);
    return 0;
}

static uint16_t address_shapes(void)
{
    mac_header_t header;
    mac_frame_info_t decoded;
    uint8_t storage[127], payload[102], length, expected, i;
    volatile uint8_t version, destination, source, flags;

    memset(payload, 0x6d, sizeof(payload));
    for (version = 0; version < 2; version++) {
        for (destination = 2; destination <= 3; destination++) {
            for (source = 2; source <= 3; source++) {
                for (flags = 0; flags < 8; flags++) {
                    data_header(&header);
                    header.version = version;
                    header.destination_mode = destination;
                    header.source_mode = source;
                    header.flags = (uint8_t)(flags << 4);
                    if (!(header.flags & MAC_FLAG_PAN_COMPRESSION))
                        header.source_pan = 0xabcd;
                    for (i = 0; i < 8; i++) {
                        header.destination[i] = (uint8_t)(i + 1u);
                        header.source[i] = (uint8_t)(0x21u + i);
                    }
                    expected = (uint8_t)(5u + (destination == 2 ? 2u : 8u)
                                        + (source == 2 ? 2u : 8u) + ((flags & 4u) ? 0u : 2u));
                    memset(storage, 0xc7, sizeof(storage));
                    CHECK(mac_frame_encode(&header, payload, sizeof(payload), storage + 1,
                                           125, &length) == MAC_CODEC_OK);
                    CHECK(length == expected + sizeof(payload));
                    CHECK(storage[0] == 0xc7 && storage[length + 1u] == 0xc7);
                    CHECK(mac_frame_decode(storage + 1, length, &decoded) == MAC_CODEC_OK);
                    CHECK(decoded.payload_offset == expected && decoded.payload_length == sizeof(payload));
                    CHECK(decoded.header.version == version && decoded.header.flags == header.flags);
                    CHECK(decoded.header.source_pan == header.source_pan);
                    CHECK(memcmp(decoded.header.destination, header.destination, destination == 2 ? 2u : 8u) == 0);
                    CHECK(memcmp(decoded.header.source, header.source, source == 2 ? 2u : 8u) == 0);
                    CHECK(memcmp(storage + 1 + expected, payload, sizeof(payload)) == 0);
                }
            }
        }
    }
    return 0;
}

static uint16_t decode_rejections(void)
{
    mac_frame_info_t decoded, saved;
    uint8_t body[126], length, bit;

