faronov/cc2530-zigbee/tests/test_mac_frame.c
    memset(&saved, 0xa5, sizeof(saved));
    for (length = 0; length < 9; length++) {
        decoded = saved;
        CHECK(mac_frame_decode(golden, length, &decoded) == MAC_CODEC_TRUNCATED);
        CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    }
    memcpy(body, golden, sizeof(golden));
    for (bit = 0; bit < 3; bit++) {
        body[0] = golden[0];
        body[1] = golden[1];
        if (bit == 0)
            body[0] |= 0x80;
        else
            body[1] |= (uint8_t)(1u << (bit - 1u));
        decoded = saved;
        CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_INVALID_HEADER);
        CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    }
    memcpy(body, golden, sizeof(golden));
    body[0] |= MAC_FLAG_SECURITY;
    decoded = saved;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_UNSUPPORTED_SECURITY);
    CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    body[0] = golden[0];
    body[1] = 0xa8;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_UNSUPPORTED_VERSION);
    body[1] = 0x94;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_UNSUPPORTED_ADDRESSING);
    body[1] = 0x98;
    body[0] = 0x64;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_UNSUPPORTED_TYPE);
    body[0] = 0x63;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_UNSUPPORTED_VERSION);
    body[1] = 0x88;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_UNSUPPORTED_COMMAND);
    memcpy(body, golden, sizeof(golden));
    body[5] = body[6] = 0xff;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_INVALID_HEADER);
    body[0] &= (uint8_t)~MAC_FLAG_ACK_REQUEST;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_OK);
    body[7] = body[8] = 0xff;
    CHECK(mac_frame_decode(body, sizeof(golden), &decoded) == MAC_CODEC_INVALID_HEADER);
    decoded = saved;
    CHECK(mac_frame_decode(body, sizeof(body), &decoded) == MAC_CODEC_TOO_LONG);
    CHECK(mac_frame_decode(body, 65535u, &decoded) == MAC_CODEC_TOO_LONG);
    CHECK(mac_frame_decode(NULL, 3, &decoded) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_frame_decode(body, 3, NULL) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    body[0] = 2;
    body[1] = 0;
    CHECK(mac_frame_decode(body, 4, &decoded) == MAC_CODEC_INVALID_HEADER);
    body[0] |= MAC_FLAG_ACK_REQUEST;
    CHECK(mac_frame_decode(body, 3, &decoded) == MAC_CODEC_INVALID_HEADER);
    CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    return 0;
}

static uint16_t encode_rejections(void)
{
    mac_header_t header;
    uint8_t storage[127], payload[117], length, i, test;
    mac_codec_result_t result;

    memset(payload, 0, sizeof(payload));
    for (test = 0; test < 8; test++) {
        data_header(&header);
        memset(storage, 0xc7, sizeof(storage));
        length = 0xa5;
        switch (test) {
        case 0:
            header.source_pan++;
            result = mac_frame_encode(&header, NULL, 0, storage, 125, &length);
            CHECK(result == MAC_CODEC_INVALID_HEADER);
            break;
        case 1:
            result = mac_frame_encode(&header, payload, sizeof(payload), storage, 125, &length);
            CHECK(result == MAC_CODEC_TOO_LONG);
            break;
        case 2:
            result = mac_frame_encode(&header, NULL, 0, storage, 8, &length);
            CHECK(result == MAC_CODEC_BUFFER_TOO_SMALL);
            break;
        case 3:
            result = mac_frame_encode(&header, NULL, 1, storage, 125, &length);
            CHECK(result == MAC_CODEC_INVALID_ARGUMENT);
            break;
        case 4:
            header.flags |= MAC_FLAG_SECURITY;
            result = mac_frame_encode(&header, NULL, 0, storage, 125, &length);
            CHECK(result == MAC_CODEC_UNSUPPORTED_SECURITY);
            break;
        case 5:
            header.destination_mode = 0;
            result = mac_frame_encode(&header, NULL, 0, storage, 125, &length);
            CHECK(result == MAC_CODEC_UNSUPPORTED_ADDRESSING);
            break;
        case 6:
            header.version = 2;
            result = mac_frame_encode(&header, NULL, 0, storage, 125, &length);
            CHECK(result == MAC_CODEC_UNSUPPORTED_VERSION);
            break;
        default:
            header.type = MAC_FRAME_COMMAND;
            header.version = 0;
            result = mac_frame_encode(&header, NULL, 0, storage, 125, &length);
            CHECK(result == MAC_CODEC_TRUNCATED);
            break;
        }
        CHECK(length == 0xa5);
        for (i = 0; i < sizeof(storage); i++)
            CHECK(storage[i] == 0xc7);
    }
    data_header(&header);
    CHECK(mac_frame_encode(NULL, NULL, 0, storage, 125, &length) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_frame_encode(&header, NULL, 0, NULL, 125, &length) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_frame_encode(&header, NULL, 0, storage, 125, NULL) == MAC_CODEC_INVALID_ARGUMENT);
    CHECK(mac_frame_encode(&header, payload, 65535u, storage, 125, &length) == MAC_CODEC_TOO_LONG);
    CHECK(length == 0xa5);
    return 0;
}

static uint16_t self_test(void)
{
    uint16_t result;
    result = golden_vectors();
    if (result != 0)
        return result;
    result = address_shapes();
    if (result != 0)
        return result;
    result = decode_rejections();
    if (result != 0)
        return result;
    result = encode_rejections();
    if (result != 0)
        return result;
    result = command_vectors();
    if (result != 0)
        return result;
    result = command_frame_vectors();
    if (result != 0)
        return result;
    result = command_payload_rejections();
    if (result != 0)
        return result;
    result = beacon_vectors();
    if (result != 0)
        return result;
    result = beacon_address_lists();
    if (result != 0)
        return result;
    result = beacon_rejections();
    if (result != 0)
        return result;
    result = nwk_beacon_integration();
    if (result != 0)
        return result;
    return nwk_data_integration();
}

#if defined(__SDCC)
/* Simulator-only result ABI; this is not a board firmware build target. */
volatile MCU_XDATA MCU_AT(0x1e00) uint8_t mac_test_result[8];

void main(void)
{
    uint16_t result = self_test();
    mac_test_result[0] = 'M';
    mac_test_result[1] = 'A';
    mac_test_result[2] = 'C';
    mac_test_result[3] = '1';
    mac_test_result[4] = 1;
    mac_test_result[5] = 8;
    mac_test_result[6] = (uint8_t)result;
    mac_test_result[7] = (uint8_t)(result >> 8);
    __asm
        .globl _mac_codec_done
    _mac_codec_done:
        nop
    __endasm;
    for (;;) {
    }
}
#else
#include <stdio.h>
#include <stdlib.h>

