faronov/cc2530-zigbee/tests/test_mac_frame.c
static uint16_t command_field_case(const mac_command_t *command, const uint8_t *payload,
                                   uint8_t size, uint8_t valid)
{
    mac_command_t decoded, saved;
    mac_codec_result_t status, expected;
    uint8_t output[4], length = 0xa5, i;
    uint8_t id = command->identifier;

    expected = valid ? MAC_CODEC_OK : ((id >= 1u && id <= 4u) || id == 7u
                                      ? MAC_CODEC_INVALID_COMMAND : MAC_CODEC_UNSUPPORTED_COMMAND);
    memset(output, 0xc7, sizeof(output));
    status = mac_command_encode(command, output, sizeof(output), &length);
    CHECK(status == expected);
    if (valid) {
        CHECK(length == size && memcmp(output, payload, size) == 0);
        for (i = size; i < sizeof(output); i++)
            CHECK(output[i] == 0xc7);
    } else {
        CHECK(length == 0xa5);
        for (i = 0; i < sizeof(output); i++)
            CHECK(output[i] == 0xc7);
    }
    memset(&saved, 0xa5, sizeof(saved));
    decoded = saved;
    CHECK(mac_command_decode(payload, size, &decoded) == expected);
    if (valid) {
        CHECK(decoded.identifier == id);
        CHECK(decoded.capability == (id == 1u ? command->capability : 0u));
        CHECK(decoded.short_address == (id == 2u ? command->short_address : 0u));
        CHECK(decoded.status == (id == 2u ? command->status : 0u));
        CHECK(decoded.reason == (id == 3u ? command->reason : 0u));
    } else
        CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
    return 0;
}

static uint16_t exhaustive_command_fields(void)
{
    mac_command_t command;
    uint8_t payload[4], size;
    uint16_t result;
    uint32_t address;
    unsigned value, status;

    memset(&command, 0xa5, sizeof(command));
    command.capability = 0;
    command.short_address = 0xffff;
    command.status = 1;
    command.reason = 1;
    for (value = 0; value < 256; value++) {
        command.identifier = (uint8_t)value;
        payload[0] = (uint8_t)value;
        payload[1] = value == 1u ? 0u : (value == 3u ? 1u : 0xffu);
        payload[2] = 0xff;
        payload[3] = 1;
        size = value == 2u ? 4u : ((value == 1u || value == 3u) ? 2u : 1u);
        result = command_field_case(&command, payload, size, (value >= 1u && value <= 4u) || value == 7u);
        if (result != 0)
            return result;
    }
    for (value = 0; value < 256; value++) {
        command.identifier = payload[0] = 1;
        command.capability = payload[1] = (uint8_t)value;
        result = command_field_case(&command, payload, 2, (value & 0x30u) == 0u);
        if (result != 0)
            return result;
        command.identifier = payload[0] = 3;
        command.reason = payload[1] = (uint8_t)value;
        result = command_field_case(&command, payload, 2, value == 1u || value == 2u);
        if (result != 0)
            return result;
        command.identifier = payload[0] = 2;
        command.status = payload[3] = (uint8_t)value;
        payload[2] = 0xff;
        for (address = 0xfffeu; address <= 0xffffu; address++) {
            command.short_address = (uint16_t)address;
            payload[1] = (uint8_t)address;
            result = command_field_case(&command, payload, 4,
                                         address == 0xfffeu ? value == 0u : (value == 1u || value == 2u));
            if (result != 0)
                return result;
        }
    }
    for (address = 0; address < 65536UL; address++) {
        command.short_address = (uint16_t)address;
        payload[1] = (uint8_t)address;
        payload[2] = (uint8_t)(address >> 8);
        for (status = 0; status < 3; status++) {
            command.status = payload[3] = (uint8_t)status;
            result = command_field_case(&command, payload, 4, status == 0u ? address != 0xffffu : address == 0xffffu);
            if (result != 0)
                return result;
        }
    }
    return 0;
}

static uint16_t exhaustive_command_control_fields(void)
{
    uint32_t control, canonical, alternate;
    unsigned vector, i;
    uint8_t body[25], output[25], length, size, valid;
    mac_frame_info_t decoded, saved;
    mac_codec_result_t status;

    memset(&saved, 0xa5, sizeof(saved));
    for (vector = 0; vector < sizeof(command_frame_lengths); vector++) {
        size = command_frame_lengths[vector];
        memcpy(body, command_frames[vector], size);
        canonical = (uint32_t)body[0] | ((uint32_t)body[1] << 8);
        /* Mixed-address polls have equal MHR lengths in either address order. */
        alternate = vector == 8u || vector == 9u ? canonical ^ 0x4400u : canonical;
        for (control = 3; control < 65536UL; control += 8) {
            body[0] = (uint8_t)control;
            body[1] = (uint8_t)(control >> 8);
            decoded = saved;
            valid = (control & ~MAC_FLAG_PENDING) == canonical || (control & ~MAC_FLAG_PENDING) == alternate;
            CHECK((mac_frame_decode(body, size, &decoded) == MAC_CODEC_OK) == valid);
            if (!valid) {
                CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
                continue;
            }
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            status = mac_frame_encode(&decoded.header, body + decoded.payload_offset,
                                      decoded.payload_length, output, sizeof(output), &length);
            if (control & MAC_FLAG_PENDING) {
                CHECK(status == MAC_CODEC_INVALID_HEADER && length == 0xa5);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            } else
                CHECK(status == MAC_CODEC_OK && length == size && memcmp(output, body, size) == 0);
        }
    }
    return 0;
}

static uint16_t exact_command_boundaries(void)
{
    mac_command_t command, decoded_command, saved_command;
    mac_frame_info_t decoded_frame, saved_frame;
    mac_header_t header;
    mac_codec_result_t status, expected;
    unsigned kind, vector, count, size, complete, payload_size, offset, i;
    uint8_t *input, *output, *payload, length;
    uint8_t storage[25];
    const uint8_t *golden_body;

