faronov/cc2530-zigbee/tests/test_mac_frame.c
    memset(&saved_command, 0xa5, sizeof(saved_command));
    memset(&saved_frame, 0xa5, sizeof(saved_frame));
    for (kind = 0; kind < 2; kind++) {
        count = kind == 0u ? sizeof(command_payload_lengths) : sizeof(command_frame_lengths);
        for (vector = 0; vector < count; vector++) {
            complete = kind == 0u ? command_payload_lengths[vector] : command_frame_lengths[vector];
            offset = kind == 0u ? 0u : command_frame_offsets[vector];
            payload_size = complete - offset;
            golden_body = kind == 0u ? command_payloads[vector] : command_frames[vector];
            payload = malloc(payload_size);
            CHECK(payload != NULL);
            memcpy(payload, golden_body + offset, payload_size);
            CHECK(mac_command_decode(payload, (uint16_t)payload_size, &command) == MAC_CODEC_OK);
            if (kind != 0u)
                command_header(&header, (uint8_t)vector);
            for (size = 0; size <= complete + 1u; size++) {
                input = malloc(size ? size : 1u);
                output = malloc(size ? size : 1u);
                CHECK(input != NULL && output != NULL);
                memset(input, 0, size ? size : 1u);
                memcpy(input, golden_body, size <= complete ? size : complete);
                memset(output, 0xc7, size ? size : 1u);
                expected = size < complete ? MAC_CODEC_TRUNCATED : (size == complete ? MAC_CODEC_OK
                           : (payload_size == 4u ? MAC_CODEC_TOO_LONG : MAC_CODEC_INVALID_COMMAND));
                decoded_command = saved_command;
                decoded_frame = saved_frame;
                status = kind == 0u ? mac_command_decode(input, (uint16_t)size, &decoded_command)
                         : mac_frame_decode(input, (uint16_t)size, &decoded_frame);
                CHECK(status == expected);
                if (status != MAC_CODEC_OK) {
                    CHECK(memcmp(&decoded_command, &saved_command, sizeof(saved_command)) == 0);
                    CHECK(memcmp(&decoded_frame, &saved_frame, sizeof(saved_frame)) == 0);
                }
                length = 0xa5;
                status = kind == 0u ? mac_command_encode(&command, output, (uint16_t)size, &length)
                         : mac_frame_encode(&header, payload, (uint16_t)payload_size, output, (uint16_t)size, &length);
                if (size < complete) {
                    CHECK(status == MAC_CODEC_BUFFER_TOO_SMALL && length == 0xa5);
                    for (i = 0; i < (size ? size : 1u); i++)
                        CHECK(output[i] == 0xc7);
                } else {
                    CHECK(status == MAC_CODEC_OK && length == complete);
                    CHECK(memcmp(output, golden_body, complete) == 0);
                    if (size > complete)
                        CHECK(output[complete] == 0xc7);
                }
                free(input);
                free(output);
            }
            if (kind != 0u) {
                for (size = 0; size < payload_size; size++) {
                    input = malloc(size ? size : 1u);
                    CHECK(input != NULL);
                    memcpy(input, payload, size);
                    memset(storage, 0xc7, sizeof(storage));
                    length = 0xa5;
                    CHECK(mac_frame_encode(&header, input, (uint16_t)size, storage, sizeof(storage), &length)
                          == MAC_CODEC_TRUNCATED);
                    CHECK(length == 0xa5);
                    for (i = 0; i < sizeof(storage); i++)
                        CHECK(storage[i] == 0xc7);
                    free(input);
                }
            }
            free(payload);
        }
    }
    return 0;
}

static uint16_t exhaustive_control_fields(void)
{
    uint32_t control;
    unsigned accepted = 0;
    uint8_t body[23], output[23], length, input_length;
    mac_frame_info_t decoded, saved;

    memset(&saved, 0xa5, sizeof(saved));
    memset(body, 0x10, sizeof(body));
    for (control = 0; control < 65536UL; control++) {
        body[0] = (uint8_t)control;
        body[1] = (uint8_t)(control >> 8);
        input_length = (control & 7u) == MAC_FRAME_ACK ? 3u : 23u;
        decoded = saved;
        if (mac_frame_decode(body, input_length, &decoded) != MAC_CODEC_OK) {
            CHECK(memcmp(&decoded, &saved, sizeof(saved)) == 0);
            continue;
        }
        accepted++;
        CHECK(mac_frame_encode(&decoded.header, body + decoded.payload_offset,
                               decoded.payload_length, output, sizeof(output), &length) == MAC_CODEC_OK);
        CHECK(length == input_length && memcmp(output, body, length) == 0);
    }
    CHECK(accepted == 66u);
    return 0;
}

static uint16_t exact_buffer_boundaries(void)
{
    uint8_t complete[23], payload[116], *body, length;
    unsigned size, i;
    mac_header_t header;
    mac_frame_info_t decoded;
    mac_codec_result_t result;

    memset(complete, 0x10, sizeof(complete));
    complete[0] = 1;
    complete[1] = 0xdc;
    for (size = 0; size < sizeof(complete); size++) {
        body = malloc(size ? size : 1u);
        CHECK(body != NULL);
        memcpy(body, complete, size);
        result = mac_frame_decode(body, (uint16_t)size, &decoded);
        free(body);
        CHECK(result == MAC_CODEC_TRUNCATED);
    }
    data_header(&header);
    memset(payload, 0xa5, sizeof(payload));
    for (size = 0; size <= MAC_FRAME_MAX_BODY; size++) {
        body = malloc(size ? size : 1u);
        CHECK(body != NULL);
        memset(body, 0xc7, size);
        length = 0xcc;
        result = mac_frame_encode(&header, payload, sizeof(payload), body, (uint16_t)size, &length);
        if (size < MAC_FRAME_MAX_BODY) {
            CHECK(result == MAC_CODEC_BUFFER_TOO_SMALL && length == 0xcc);
            for (i = 0; i < size; i++)
                CHECK(body[i] == 0xc7);
        } else {
            CHECK(result == MAC_CODEC_OK && length == 125);
            CHECK(memcmp(body + 9, payload, sizeof(payload)) == 0);
        }
        free(body);
    }
    return 0;
}

static uint16_t invalid_header_fields(void)
{
    mac_header_t header;
    mac_codec_result_t result;
    uint8_t output[23], length;
    unsigned field, value, expected, i;

    for (field = 0; field < 5; field++) {
        for (value = 0; value < 256; value++) {
            data_header(&header);
            expected = 0;
            switch (field) {
            case 0:
                header.type = (uint8_t)value;
                expected = value == 1;
                break;
            case 1:
                header.version = (uint8_t)value;
                expected = value <= 1;
                break;
            case 2:
                header.flags = (uint8_t)value;
                expected = (value & ~0x70u) == 0;
                break;
            case 3:
                header.destination_mode = (uint8_t)value;
                expected = value == 2 || value == 3;
                break;
            default:
                header.source_mode = (uint8_t)value;
                expected = value == 2 || value == 3;
                break;
            }
            memset(output, 0xc7, sizeof(output));
            length = 0xcc;
            result = mac_frame_encode(&header, NULL, 0, output, sizeof(output), &length);
            CHECK((result == MAC_CODEC_OK) == expected);
            if (!expected) {
                CHECK(length == 0xcc);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            }
        }
    }
    memset(&header, 0, sizeof(header));
    header.type = MAC_FRAME_ACK;
    CHECK(mac_frame_encode(&header, golden + 9, 1, output, sizeof(output), &length) == MAC_CODEC_INVALID_HEADER);
    header.version = 1;
    CHECK(mac_frame_encode(&header, NULL, 0, output, sizeof(output), &length) == MAC_CODEC_UNSUPPORTED_VERSION);
    return 0;
}

static uint16_t exhaustive_beacon_fields(void)
{
    mac_beacon_info_t beacon, saved;
    mac_codec_result_t status;
    uint8_t payload[113];
    uint32_t value;
    unsigned size, expected;

