faronov/cc2530-zigbee/tests/test_mac_frame.c
    memset(&saved, 0xa5, sizeof(saved));
    memset(payload, 0x69, sizeof(payload));
    payload[2] = payload[3] = 0;
    for (value = 0; value < 65536UL; value++) {
        payload[0] = (uint8_t)value;
        payload[1] = (uint8_t)(value >> 8);
        beacon = saved;
        status = mac_beacon_decode(payload, 4, &beacon);
        CHECK((status == MAC_CODEC_OK) == ((value & 0x2000u) == 0));
        if (status == MAC_CODEC_OK)
            CHECK(beacon.superframe_specification == value);
        else
            CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
    }
    payload[0] = 0xff;
    payload[1] = 0xcf;
    for (value = 0; value < 256; value++) {
        payload[2] = (uint8_t)value;
        beacon = saved;
        status = mac_beacon_decode(payload, 4, &beacon);
        CHECK(status == ((value & 0x78u) ? MAC_CODEC_INVALID_BEACON :
                         (value & 7u) ? MAC_CODEC_UNSUPPORTED_BEACON : MAC_CODEC_OK));
        if (status == MAC_CODEC_OK)
            CHECK(beacon.gts_permit == value >> 7);
        else
            CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
    }
    payload[2] = 0;
    for (value = 0; value < 256; value++) {
        payload[3] = (uint8_t)value;
        size = 4u + 2u * (value & 7u) + 8u * ((value >> 4) & 7u);
        expected = !(value & 0x88u) && (value & 7u) + ((value >> 4) & 7u) <= 7;
        beacon = saved;
        status = mac_beacon_decode(payload, (uint16_t)size, &beacon);
        CHECK((status == MAC_CODEC_OK) == expected);
        if (status != MAC_CODEC_OK)
            CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
    }
    payload[3] = 1;
    for (value = 0; value < 65536UL; value++) {
        payload[4] = (uint8_t)value;
        payload[5] = (uint8_t)(value >> 8);
        beacon = saved;
        status = mac_beacon_decode(payload, 6, &beacon);
        CHECK((status == MAC_CODEC_OK) == (value != 0xffffu));
        if (status != MAC_CODEC_OK)
            CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
    }
    return 0;
}

static uint16_t beacon_header_fields(void)
{
    mac_header_t header;
    mac_frame_info_t frame, saved;
    mac_codec_result_t status;
    uint8_t body[17], output[17], length, offset;
    uint32_t control;
    unsigned field, value, expected, i, accepted = 0;

    for (field = 0; field < 5; field++) {
        for (value = 0; value < 256; value++) {
            beacon_header(&header, MAC_ADDRESS_SHORT);
            switch (field) {
            case 0: header.type = (uint8_t)value; expected = value == 0; break;
            case 1: header.version = (uint8_t)value; expected = value == 0; break;
            case 2: header.flags = (uint8_t)value; expected = value == 0 || value == MAC_FLAG_PENDING; break;
            case 3: header.destination_mode = (uint8_t)value; expected = value == 0; break;
            default: header.source_mode = (uint8_t)value; expected = value == 2 || value == 3; break;
            }
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            status = mac_frame_encode(&header, beacon_frames[0] + 7, 4, output, sizeof(output), &length);
            CHECK((status == MAC_CODEC_OK) == expected);
            if (!expected) {
                CHECK(length == 0xa5);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            }
        }
    }
    for (field = 0; field < 2; field++) {
        for (control = 0; control < 65536UL; control++) {
            beacon_header(&header, MAC_ADDRESS_SHORT);
            if (field == 0) {
                header.source[0] = (uint8_t)control;
                header.source[1] = (uint8_t)(control >> 8);
                expected = control < 0xfffeu;
            } else {
                header.source_pan = (uint16_t)control;
                expected = control != 0xffffu;
            }
            memset(output, 0xc7, sizeof(output));
            length = 0xa5;
            status = mac_frame_encode(&header, beacon_frames[0] + 7, 4, output, sizeof(output), &length);
            CHECK((status == MAC_CODEC_OK) == expected);
            if (!expected) {
                CHECK(length == 0xa5);
                for (i = 0; i < sizeof(output); i++)
                    CHECK(output[i] == 0xc7);
            }
        }
    }
    memset(&saved, 0xa5, sizeof(saved));
    for (control = 0; control < 65536UL; control += 8) {
        memset(body, 0x21, sizeof(body));
        body[0] = (uint8_t)control;
        body[1] = (uint8_t)(control >> 8);
        offset = (control & 0xc000u) == 0xc000u ? 13 : 7;
        memcpy(body + offset, beacon_frames[0] + 7, 4);
        frame = saved;
        status = mac_frame_decode(body, offset + 4u, &frame);
        expected = (control & ~0x4010UL) == 0x8000u;
        CHECK((status == MAC_CODEC_OK) == expected);
        if (!expected) {
            CHECK(memcmp(&frame, &saved, sizeof(frame)) == 0);
        } else {
            accepted++;
            CHECK(mac_frame_encode(&frame.header, body + frame.payload_offset, frame.payload_length,
                                   output, sizeof(output), &length) == MAC_CODEC_OK);
            CHECK(length == offset + 4u && memcmp(output, body, length) == 0);
        }
    }
    CHECK(accepted == 4);
    return 0;
}

static uint16_t exact_beacon_boundaries(void)
{
    mac_header_t header;
    mac_frame_info_t frame, saved_frame;
    mac_beacon_info_t beacon, saved;
    mac_codec_result_t status, expected;
    uint8_t complete[125], payload[113], output[125], *input, *encoded, length;
    unsigned size, capacity, i;

    beacon_header(&header, MAC_ADDRESS_EXTENDED);
    memset(payload, 0x69, sizeof(payload));
    payload[0] = 0xff;
    payload[1] = 0xcf;
    payload[2] = 0;
    payload[3] = 0x70;
    CHECK(mac_frame_encode(&header, payload, 112, complete, sizeof(complete), &length) == MAC_CODEC_OK);
    CHECK(length == 125);
    memset(&saved, 0xa5, sizeof(saved));
    memset(&saved_frame, 0xa5, sizeof(saved_frame));
    for (size = 0; size <= 126; size++) {
        input = malloc(size ? size : 1u);
        CHECK(input != NULL);
        memcpy(input, complete, size < 125 ? size : 125);
        frame = saved_frame;
        status = mac_frame_decode(input, (uint16_t)size, &frame);
        free(input);
        expected = size < 73 ? MAC_CODEC_TRUNCATED : size > 125 ? MAC_CODEC_TOO_LONG : MAC_CODEC_OK;
        CHECK(status == expected);
        if (status != MAC_CODEC_OK)
            CHECK(memcmp(&frame, &saved_frame, sizeof(frame)) == 0);
    }
    for (size = 0; size <= 113; size++) {
        input = malloc(size ? size : 1u);
        CHECK(input != NULL);
        memcpy(input, payload, size);
        beacon = saved;
        status = mac_beacon_decode(input, (uint16_t)size, &beacon);
        expected = size < 60 ? MAC_CODEC_TRUNCATED : size > 112 ? MAC_CODEC_TOO_LONG : MAC_CODEC_OK;
        CHECK(status == expected);
        if (status != MAC_CODEC_OK)
            CHECK(memcmp(&beacon, &saved, sizeof(beacon)) == 0);
        memset(output, 0xc7, sizeof(output));
        length = 0xa5;
        CHECK(mac_frame_encode(&header, input, (uint16_t)size, output, sizeof(output), &length) == expected);
        free(input);
        if (expected != MAC_CODEC_OK) {
            CHECK(length == 0xa5);
            for (i = 0; i < sizeof(output); i++)
                CHECK(output[i] == 0xc7);
        } else {
            CHECK(length == 13 + size);
            CHECK(memcmp(output, complete, length) == 0);
        }
    }
    for (capacity = 0; capacity <= 126; capacity++) {
        encoded = malloc(capacity ? capacity : 1u);
        CHECK(encoded != NULL);
        memset(encoded, 0xc7, capacity);
        length = 0xa5;
        status = mac_frame_encode(&header, payload, 112, encoded, (uint16_t)capacity, &length);
        if (capacity < 125) {
            CHECK(status == MAC_CODEC_BUFFER_TOO_SMALL && length == 0xa5);
            for (i = 0; i < capacity; i++)
                CHECK(encoded[i] == 0xc7);
        } else {
            CHECK(status == MAC_CODEC_OK && length == 125 && memcmp(encoded, complete, 125) == 0);
            if (capacity == 126)
                CHECK(encoded[125] == 0xc7);
        }
        free(encoded);
    }
    length = 0xa5;
    CHECK(mac_frame_encode(&header, NULL, 0, output, sizeof(output), &length) == MAC_CODEC_TRUNCATED);
    CHECK(length == 0xa5);
    return 0;
}

int main(void)
{
    uint16_t result = self_test();
    if (result == 0)
        result = exhaustive_control_fields();
    if (result == 0)
        result = exact_buffer_boundaries();
    if (result == 0)
        result = invalid_header_fields();
    if (result == 0)
        result = command_address_shapes();
    if (result == 0)
        result = command_frame_rejections();
    if (result == 0)
        result = exhaustive_command_fields();
    if (result == 0)
        result = exhaustive_command_control_fields();
    if (result == 0)
        result = exact_command_boundaries();
    if (result == 0)
        result = exhaustive_beacon_fields();
    if (result == 0)
        result = beacon_header_fields();
    if (result == 0)
        result = exact_beacon_boundaries();
    if (result != 0) {
        fprintf(stderr, "MAC codec test failed at line %u\n", (unsigned)result);
        return 1;
    }
    puts("host MAC codec: DATA/ACK, five commands, no-GTS Beacons, exhaustive fields and exact bounds PASS");
    return 0;
}
#endif
